#include <iostream>
#include <windows.h>
#include <stdlib.h>
#include <fstream>
#include <string>
#include <conio.h>
#include <vector>
#include<iomanip>
using namespace std;
int mau_chu = 11;
int mau_thong_bao = 4;
// giao dien
void TextColor(int color); // đổ màu
void gotoXY(int x, int y);// tọa độ
void Ox(int x1, int x2, int y);// vẽ trục ngang
void Oy(int y1, int y2, int x, int d);// vẽ trục đứng
void Table(int x, int y, int* a, int b, int m, int n, int size, int color);// vẽ bảng

int menu_1(int x, int y);
int menu_2(int x, int y, int chuc_nang1, int d);

// xu ly
string in_thuong(string s);
void chuan_hoa_ngay(string &s);
bool so_sanh_ngay(string d1, string d2);
string int_sang_string(int x);
int string_sang_int(string s);
bool kiem_tra_ma(string &s);
bool kiem_tra_ten(string &s);
bool kiem_tra_so(string &s);
bool kiem_tra_ngay(string &s);
bool kiem_tra_email(string &s);
string nhap_ten(int x, int y, int tb_x, int tb_y, int len);
string nhap_ngay(int x, int y, int tb_x, int tb_y, int len);
string nhap_ma(int x, int y, int tb_x, int tb_y, int len);
string nhap_sdt(int x, int y, int tb_x, int tb_y, int len);
string nhap_email(int x, int y, int tb_x, int tb_y, int len);
//
struct SinhVien{
    string MaSV; // 10
    string HoTen; // 30
    string NgaySinh; // 10
    string GioiTinh; // nam/nu
    string MaLop; // 10 
    string DiaChi; // 30
    string SDT; // 10
    string Email; // 35
};
bool doc_file(SinhVien *A, int &n);
void xuat_file(SinhVien *A, int &n);
void Nhap(SinhVien *A, int &n, int x, int y, int tbX, int tbY);
void Xuat(SinhVien a, int x, int y);
void Sua(SinhVien &a, int x, int y, int tbX, int tbY);
int TimKiem(SinhVien *A, int n, string s, int x, int y, int tbX, int tbY);
void Sua(SinhVien *A, int n, string s, int x, int y, int tbX, int tbY);
void Xoa(SinhVien *A, int &n, string s, int x, int y, int tbX, int tbY);
void DSTheoLop(SinhVien *A, int &n, string s, int x, int y);

// giang vien
struct GiangVien{
    string MaGV; // 10
    string TenGV; // 30
    string NgaySinh; // 10
    string GioiTinh; // 
    string Khoa; // 30
    string SDT; // 10
    string Email; // 30
};
bool doc_file(GiangVien *A, int &n);
void xuat_file(GiangVien *A, int &n);
void Nhap(GiangVien *A, int &n, int x, int y, int tbX, int tbY);
void Xuat(GiangVien a, int x, int y);
void Sua(GiangVien &a, int x, int y, int tbX, int tbY);
int TimKiem(GiangVien *A, int n, string s, int x, int y, int tbX, int tbY);
void Sua(GiangVien *A, int n, string s, int x, int y, int tbX, int tbY);
void DSTheoKhoa(GiangVien *A, int &n, string s, int x, int y);
void DSTheoTen(GiangVien *A, int &n, string s, int x, int y);
// tin chi
struct TinChi{
    string MaTC; //10
    string TenTC;// 30
    int LT; // [0, 2]
    int TH; // [0, 2]
    int SVMax; // [10, 15];
    int SVMin; // [5, 8]
    bool TrangThai; // huy / mo
    string MaGV1; // 10
    string MaGV2; // 10
};
bool doc_file(TinChi *A, int &n);
void xuat_file(TinChi *A, int &n);
void Nhap(TinChi *A, int &n, int x, int y, int tbX, int tbY);
void Xuat(TinChi a, int x, int y);
void Xuat(TinChi a, int x, int y, int color);
void Sua(TinChi &a, int x, int y, int tbX, int tbY);
int TimKiem(TinChi *A, int n, string s, int x, int y, int tbX, int tbY);
void Sua(TinChi *A, int n, string s, int x, int y, int tbX, int tbY);
void HuyTin(TinChi *A, int n, int x, int y, int tbX, int tbY);
void DSTheoTen(TinChi *A, int &n, string ten, int x, int y);
void DSTinChi(TinChi *A, int n, int x, int y, int chuc_nang);

// chuc nang khac
void DanhSachDangKy(string maGV, TinChi* TC, int nTC, int x, int y, int tbX, int tbY);
void DangKyTin(string maGV, TinChi* TC, int nTC, int x, int y, int tbX, int tbY);
// ds dang ky
struct DangKy{
    string MaSV;
    string MaTC; // 10
    float GK;
    float CK;
};
bool doc_file(DangKy* A, int &n);
void xuat_file(DangKy* A, int &n);
void Xuat(DangKy a, int x, int y);
void Them(string ma1, string ma2, DangKy* A, int &n);
void DangKyMon(string maSV, TinChi *TC, int nTC, DangKy* DK, int &nDK, int x, int y, int tbX, int tbY);
bool Check(DangKy* A, int &n, string s);
void DSDangKy(DangKy* A, int &n, string s, int x, int y);
void HuyTin(DangKy* A, int &n, string s, int x, int y, int tbX, int tbY);
int SoLuongSV(DangKy* A, int &n, string s);
void HuyTin(TinChi* TC, int nTC, DangKy *DK, int nDK, int x, int y);
void DSLop(string s, DangKy* DK, int nDK, int x, int y);
void NhapDiem1(string s, DangKy* DK, int nDK, int x, int y);
void NhapDiem(string maGV, TinChi* TC, int nTC, DangKy* DK, int nDK, int x, int y, int tbX, int tbY);
int main(){
    system("cls");
    int x = 5, y = 2, tbX = 20, tbY = 15;
    GiangVien *GV = new GiangVien[100]; int nGV;
    if(!doc_file(GV, nGV)){
